function [Point] = WingPattern(Z0, Lx, Ly, Tetta, Px, Py)

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Вид вводимых параметров

% % Расстояние от камер до начала объекта в мм
% Z0 = 10;
% 
% % Опредление размера объекта в мм
% Lx = 20;
% Ly = 100;
% 
% % Угол наклона оси Y к линии визирования камер в градусах
% Tetta = 30;
% 
% % Опредление плотности точек, т.е. число точек на 1 мм объекта. По двум осям
% Px = 4;
% Py = 4;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% Опредление числа точек по осям
Nx = Lx/Px + 1;
Ny = Ly/Py + 1;

% Инициализация массивов
X = zeros(Nx,Ny);
Y = zeros(Nx,Ny);
Z = zeros(Nx,Ny);

for i = 1:Nx
    for j = 1:Ny
        X(i,j) = (i-1)*Lx/(Nx-1) - Lx/2;
        Y(i,j) = (j-1)*Ly/(Ny-1) - Ly/2;
        Z(i,j) = tan(Tetta*pi/180)*Y(i,j) + Z0; % + (Ly*0.05)*sin((i-1)/(2*pi)) или + (Ly*0.05)*sin((j-1)/(2*pi)) Добавляет деформацию ввиде волны по осям
    end
end

% Подсчёт числа точек
NP = Nx*Ny;

% Инициализация вектора точек
Point = zeros(NP,3);

% Формирование вектора точек
p = 1;

for j = 1:Ny
    for i = 1:Nx
        Point(p,1) = X(i,j);
        Point(p,2) = Y(i,j);
        Point(p,3) = Z(i,j);
        p = p + 1;
    end
end

% Ввод точек в 3D 
plot3(X, Y, Z, '*');
grid on

end

